export function getBeforeText() {
  return wantSayToYou.before;
}

export function getMusicText() {
  const arr = wantSayToYou.nesteastMusic;
  return arr.map(item => {
    let arr = [...item.text];
    if (item.name) {
      arr.push(`--by ${item.name}`);
    }
    return {
      text: arr
    };
  });
}

export function getPoemText() {
  const arr = wantSayToYou.poemLine;
  return arr.map(item => {
    let arr = [...item.text];
    if (item.by) {
      arr.push(`--by ${item.by}`);
    }
    return {
      text: arr
    };
  });
}

export function getAcoText() {
  const arr = wantSayToYou.after;
  return arr.map(item => {
    let arr = [...item.text];
    if (item.by) {
      arr.push(`--by ${item.by}`);
    }
    return {
      text: arr
    };
  });
}

const wantSayToYou = {
  before: [
    {
      text: ['READY ?']
    },
    {
      text: ['READY !']
    }
  ],
  after: [
    {
      text: ['从今以后', '只要你想', '只要我有'],
      by: 'aco'
    },
    {
      text: ['有人说', '爱情是所有的激情']
    },
    {
      text: ['直到遇见了你', '才知道']
    },
    {
      text: ['爱情是', '柴米油盐酱醋茶的生活中', '都有你'],
      by: 'aco'
    },
    {
      text: ['姑娘', '可否', '借你一生说说话'],
      by: 'aco'
    },
    {
      text: ['当然', '所有的情话都不如你'],
      by: 'aco'
    }
  ],
  nesteastMusic: [
    {
      text: ['我喜欢吃芒果', '芒果味的硬糖不行']
    },
    {
      text: ['芒果慕斯不行', '芒果汁也不行']
    },
    {
      text: ['我喜欢你', '像你的声音不行']
    },
    {
      text: ['像你的笑容不行', '不是你不行']
    },
    {
      text: ['浩渺穹苍，你是唯一'],
      name: '这世界唯一的你'
    },
    {
      text: ['下辈子', '我们还会在一起么？']
    },
    {
      text: ['上辈子', '你就问过这个问题啦！'],
      name: 'Lucky'
    },
    {
      text: ['你来人间一趟', '要看看太阳']
    },
    {
      text: ['和喜欢的人一起走在街上', '比如我'],
      name: '人间'
    },
    {
      text: ['你知道', '我喜欢的人是谁吗？', '如果你不知道']
    },
    {
      text: ['请回头', '看我写的第一个字'],
      name: "Romeo's Tune"
    },
    {
      text: ['我们将来的女儿', '小名就叫慢慢吧']
    },
    {
      text: ['慢慢长大', '慢慢生活']
    },
    {
      text: ['慢慢恋爱', '慢慢爱你'],
      name: '慢慢喜欢你'
    },
    {
      text: ['我的心脏', '在一分钟内呢', '会喊出70次的「我正活着」']
    },
    {
      text: ['但和你在一起时', '会稍微加快脚步']
    },
    {
      text: ['喊出110次的「我爱你」'],
      name: '心拍数♯0822'
    },
    {
      text: ['我有个好小好小的梦想', '才四个字', '沿途有你'],
      name: '特别的人'
    },
    {
      text: ['比起一见钟情', '我更喜欢情有独钟'],
      name: '我的名字'
    },
    {
      text: ['你是年少的欢喜', '也是余生的甜蜜'],
      name: '需要你'
    },
    {
      text: ['喜欢', '春天的花香', '夏天的海浪']
    },
    {
      text: ['秋天的枫叶', '冬天的飘雪']
    },
    {
      text: ['和每一天的你'],
      name: '左边'
    },
    {
      text: ['春夏秋冬', '你若在场', '就很美好'],
      name: '春夏秋冬'
    },
    {
      text: ['想你', '在日里、 在夜里', '在每一个恍惚的刹那里'],
      name: '借我'
    },
    {
      text: ['桃花浪漫，海棠明媚', '含笑天真，铃兰清丽']
    },
    {
      text: ['都似你，却不及你'],
      name: '爱我别走'
    },
    {
      text: ['希望', '我能成为你的小众喜好', '藏着欣喜不已']
    },
    {
      text: ['炫耀时格外骄傲'],
      name: '你不在'
    },
    {
      text: ['你就这样一路', '蹦蹦跳跳']
    },
    {
      text: ['撒着小星星', '跑到我心里啦'],
      name: 'Heartbeat'
    },
    {
      text: ['何为归途？', '夜鸟，荒路，漫漫无期']
    },
    {
      text: ['可否具体？', '碎言，华灯，喧嚣无际']
    },
    {
      text: ['可否再具体？', '一诗，一酌，不觉千里']
    },
    {
      text: ['仍是不解？', '与你，四处为安'],
      name: '浮生'
    },
    {
      text: ['何为思念？', '日月，星辰，旷野雨落']
    },
    {
      text: ['可否具体？', '山川，江流，烟袅湖泊']
    },
    {
      text: ['可否再具体？', '万物是你，无可躲'],
      name: '浮生'
    }
  ],
  poemLine: [
    {
      text: ['当我和拥挤的人群', '一同在路上走过时']
    },
    {
      text: ['我看见了你', '从阳台上递过来的微笑']
    },
    {
      text: ['我歌唱着', '忘记了所有的喧嚣'],
      by: '泰戈尔 《飞鸟集》'
    },
    {
      text: ['纤云弄巧，飞星传恨', '银汉迢迢暗度']
    },
    {
      text: ['金风玉露一相逢', '便胜却、人间无数']
    },
    {
      text: ['柔情似水，佳期如梦', '忍顾鹊桥归路']
    },
    {
      text: ['两情若是久长时', '又岂在、朝朝暮暮'],
      by: '秦观 《鹊桥仙》'
    },
    {
      text: ['你见，或者不见我', '我就在那里', '不悲不喜']
    },
    {
      text: ['你念，或者不念我', '情就在那里', '不来不去']
    },
    {
      text: ['你爱，或者不爱我', '爱就在那里', '不增不减']
    },
    {
      text: ['你跟，或者不跟我', '我的手就在你手里', '不舍不弃']
    },
    {
      text: ['来我的怀里', '或者', '让我住进你的心里']
    },
    {
      text: ['默然 相爱', '寂静 欢喜'],
      by: '多多 《疑似风月中集》'
    },
    {
      text: ['你骂完我，转身就走', '我很生气']
    },
    {
      text: ['悄悄地跟在你的后面'],
      by: '知乎 Meredith13'
    },
    {
      text: ['一点朱砂，两方罗帕', '三五鸿雁，乱了四季杨花']
    },
    {
      text: ['六弦绿绮，七星当挂', '八九分相思', '懒了十年琵琶'],
      by: '《十步吟》'
    },
    {
      text: ['一阶青苔', '参差荇菜']
    },
    {
      text: ['雨来了花开', '你来了我在']
    },
    {
      text: ['你可以大到天上云彩', '你可以小到我胸前口袋']
    },
    {
      text: ['你有多乖', '我就有多坏']
    },
    {
      text: ['我有多坏', '你就有多爱']
    },
    {
      text: ['想和你生个男孩', '放荡不羁', '洒脱无赖']
    },
    {
      text: ['想和你生个女孩', '清汤挂面', '红颜祸害']
    },
    {
      text: ['我们怎么长得？', '你很好看', '我也很帅']
    },
    {
      text: ['想带你离开']
    },
    {
      text: ['布衣蔬菜', '白云青山外'],
      by: '《你自己都不知道的事》'
    },
    {
      text: ['对你的爱像实数集', '你的有理，无理']
    },
    {
      text: ['我全部包容'],
      by: '知乎 Moonlight'
    },
    {
      text: ['你的名字', '是我听过', '最短的情诗'],
      by: '知乎 任时豪'
    },
    {
      text: ['书画琴棋诗酒花', '因为你', '柴米油盐酱醋茶'],
      by: '知乎 御风'
    },
    {
      text: ['浮世万千，吾爱有三', '日，月与卿']
    },
    {
      text: ['日为朝', '月为暮', '卿为朝朝暮暮'],
      by: '未知'
    },
    {
      text: ['肉 分你一点', '被子 分你一半']
    },
    {
      text: ['你', '全是我的', '不分不分'],
      by: '知乎 嚯这个姑娘'
    },
    {
      text: ['早上的日出', '夜空下的星海', '还有你'],
      by: '知乎 正派的天马'
    },
    {
      text: ['阳光', '空气', '你'],
      by: '知乎 季艺'
    }
  ]
};
